back_var_v3/constant/cloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
| Generated by Python          | OpenFOAM: The Open Source CFD Toolbox         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       vectorField;
    object      cloudPositions;
}

(
(-0.390000 0.001000 -0.225000)
(-0.390000 0.001000 -0.223193)
(-0.390000 0.001000 -0.221386)
(-0.390000 0.001000 -0.219578)
(-0.390000 0.001000 -0.217771)
(-0.390000 0.001000 -0.215964)
(-0.390000 0.001000 -0.214157)
(-0.390000 0.001000 -0.212349)
(-0.390000 0.001000 -0.210542)
(-0.390000 0.001000 -0.208735)
(-0.390000 0.001000 -0.206928)
(-0.390000 0.001000 -0.205120)
(-0.390000 0.001000 -0.203313)
(-0.390000 0.001000 -0.201506)
(-0.390000 0.001000 -0.199699)
(-0.390000 0.001000 -0.197892)
(-0.390000 0.001000 -0.196084)
(-0.390000 0.001000 -0.194277)
(-0.390000 0.001000 -0.192470)
(-0.390000 0.001000 -0.190663)
(-0.390000 0.001000 -0.188855)
(-0.390000 0.001000 -0.187048)
(-0.390000 0.001000 -0.185241)
(-0.390000 0.001000 -0.183434)
(-0.390000 0.001000 -0.181627)
(-0.390000 0.001000 -0.179819)
(-0.390000 0.001000 -0.178012)
(-0.390000 0.001000 -0.176205)
(-0.390000 0.001000 -0.174398)
(-0.390000 0.001000 -0.172590)
(-0.390000 0.001000 -0.170783)
(-0.390000 0.001000 -0.168976)
(-0.390000 0.001000 -0.167169)
(-0.390000 0.001000 -0.165361)
(-0.390000 0.001000 -0.163554)
(-0.390000 0.001000 -0.161747)
(-0.390000 0.001000 -0.159940)
(-0.390000 0.001000 -0.158133)
(-0.390000 0.001000 -0.156325)
(-0.390000 0.001000 -0.154518)
(-0.390000 0.001000 -0.152711)
(-0.390000 0.001000 -0.150904)
(-0.390000 0.001000 -0.149096)
(-0.390000 0.001000 -0.147289)
(-0.390000 0.001000 -0.145482)
(-0.390000 0.001000 -0.143675)
(-0.390000 0.001000 -0.141867)
(-0.390000 0.001000 -0.140060)
(-0.390000 0.001000 -0.138253)
(-0.390000 0.001000 -0.136446)
(-0.390000 0.001000 -0.134639)
(-0.390000 0.001000 -0.132831)
(-0.390000 0.001000 -0.131024)
(-0.390000 0.001000 -0.129217)
(-0.390000 0.001000 -0.127410)
(-0.390000 0.001000 -0.125602)
(-0.390000 0.001000 -0.123795)
(-0.390000 0.001000 -0.121988)
(-0.390000 0.001000 -0.120181)
(-0.390000 0.001000 -0.118373)
(-0.390000 0.001000 -0.116566)
(-0.390000 0.001000 -0.114759)
(-0.390000 0.001000 -0.112952)
(-0.390000 0.001000 -0.111145)
(-0.390000 0.001000 -0.109337)
(-0.390000 0.001000 -0.107530)
(-0.390000 0.001000 -0.105723)
(-0.390000 0.001000 -0.103916)
(-0.390000 0.001000 -0.102108)
(-0.390000 0.001000 -0.100301)
(-0.390000 0.001000 -0.098494)
(-0.390000 0.001000 -0.096687)
(-0.390000 0.001000 -0.094880)
(-0.390000 0.001000 -0.093072)
(-0.390000 0.001000 -0.091265)
(-0.390000 0.001000 -0.089458)
(-0.390000 0.001000 -0.087651)
(-0.390000 0.001000 -0.085843)
(-0.390000 0.001000 -0.084036)
(-0.390000 0.001000 -0.082229)
(-0.390000 0.001000 -0.080422)
(-0.390000 0.001000 -0.078614)
(-0.390000 0.001000 -0.076807)
(-0.390000 0.001000 -0.075000)
(-0.390000 0.001000 -0.073193)
(-0.390000 0.001000 -0.071386)
(-0.390000 0.001000 -0.069578)
(-0.390000 0.001000 -0.067771)
(-0.390000 0.001000 -0.065964)
(-0.390000 0.001000 -0.064157)
(-0.390000 0.001000 -0.062349)
(-0.390000 0.001000 -0.060542)
(-0.390000 0.001000 -0.058735)
(-0.390000 0.001000 -0.056928)
(-0.390000 0.001000 -0.055120)
(-0.390000 0.001000 -0.053313)
(-0.390000 0.001000 -0.051506)
(-0.390000 0.001000 -0.049699)
(-0.390000 0.001000 -0.047892)
...
)
