back_var_v3/constant/cloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      cloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type        MPPICCloud;

solution
{
    coupled         true;
    transient       yes;
    cellValueSourceCorrection off;

    maxCo           1.0;

    interpolationSchemes
    {
        rho.air         cell;
        U.air           cellPoint;
        mu.air          cell;
        alpha.air       cell;
    }

    averagingMethod dual;

    integrationSchemes
    {
        U               Euler;
    }

    sourceTerms
    {
        schemes
        {
            U           semiImplicit 1;
        }
    }
}

constantProperties
{
    rho0            8800;
    alphaMax        0.9;
}

subModels
{
    particleForces
    {
        PlessisMasliyahDrag
        {
            alphac alpha.air;
        }
        gravity;
    }


    injectionModels
    {
        model1
        {
            type                patchInjection;
            parcelBasisType     fixed;
            patchName           inlet;
            U0                  (8 0 0);
            uniformParcelSize   nParticle;
            nParticle           1;
            parcelsPerSecond    1.49e7;
            sizeDistribution
            {
                type fixedValue;
                fixedValueDistribution
                {
                    value 7e-5;
                }
            }

            flowRateProfile     constant 1;
            massTotal           0;
            SOI                 0;
            duration            5;

        }
    }

    
    dispersionModel none;

    patchInteractionModel localInteraction;

    localInteractionCoeffs
    {
        patches
        (
            outlet
            {
                type escape;
            }
            inlet
            {
                type rebound;
            }
            upperWall
            {
                type rebound;
                e    0.97;
                mu   0.09;
            }
            lowerWall
            {
                type rebound;
                e    0.97;
                mu   0.09;
            }
            frontAndBack
            {
                type rebound;
                e    0.97;
                mu   0.09;
            }
        );
    }

    heatTransferModel none;

    surfaceFilmModel none;

    packingModel explicit;

    explicitCoeffs
    {
        particleStressModel
        {
            type HarrisCrighton;
            alphaPacked 0.65;
            pSolid 10.0;
            beta 2.0;
            eps 1.0e-7;
        }
        correctionLimitingMethod
        {
            type absolute;
            e 0.9;
        }
    }

    implicitCoeffs
    {
        alphaMin 0.0001;
        rhoMin 1.0;
        applyLimiting true;
        applyGravity false;
        particleStressModel
        {
            type HarrisCrighton;
            alphaPacked 0.65;
            pSolid 5.0;
            beta 2.0;
            eps 1.0e-2;
        }
    }

    dampingModel none; // relaxation;

    relaxationCoeffs
    {
        timeScaleModel
        {
            type nonEquilibrium;
            alphaPacked 0.65;
            e 0.9;
        }
    }

    isotropyModel stochastic;

    stochasticCoeffs
    {
        timeScaleModel
        {
            type isotropic;
            alphaPacked 0.65;
            e 0.9;
        }
    }

    stochasticCollisionModel none;

    radiation off;
}


cloudFunctions
{}


// ************************************************************************* //
