back_var_v3/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          incompressibleDenseParticleFluid;

startFrom       latestTime;
startTime       0;
stopAt          endTime;

endTime         1;

deltaT          0.001;

adjustTimeStep  yes;
maxCo           0.5;

writeControl adjustableRunTime;
writeInterval 0.005;
writeLagrangian yes;

purgeWrite      0;

writeFormat     binary;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable yes;

functions
{
    #includeFunc probes
}

// ************************************************************************* //
