back_var_v3/system/probeLocations
probeLocations
(
    (-0.350000 0.000000 0.000000)
    (-0.350000 0.003000 0.000000)
    (-0.350000 0.006000 0.000000)
    (-0.350000 0.009000 0.000000)
    (-0.350000 0.012000 0.000000)
    (-0.350000 0.015000 0.000000)
    (-0.350000 0.018000 0.000000)
    (-0.350000 0.021000 0.000000)
    (-0.350000 0.024000 0.000000)
    (-0.350000 0.027000 0.000000)
    (-0.350000 0.030000 0.000000)
    (-0.350000 0.033000 0.000000)
    (-0.350000 0.036000 0.000000)
    (-0.300000 0.000000 0.000000)
    (-0.300000 0.003000 0.000000)
    (-0.300000 0.006000 0.000000)
    (-0.300000 0.009000 0.000000)
    (-0.300000 0.012000 0.000000)
    (-0.300000 0.015000 0.000000)
    (-0.300000 0.018000 0.000000)
    (-0.300000 0.021000 0.000000)
    (-0.300000 0.024000 0.000000)
    (-0.300000 0.027000 0.000000)
    (-0.300000 0.030000 0.000000)
    (-0.300000 0.033000 0.000000)
    (-0.300000 0.036000 0.000000)
    (-0.250000 0.000000 0.000000)
    (-0.250000 0.003000 0.000000)
    (-0.250000 0.006000 0.000000)
    (-0.250000 0.009000 0.000000)
    (-0.250000 0.012000 0.000000)
    (-0.250000 0.015000 0.000000)
    (-0.250000 0.018000 0.000000)
    (-0.250000 0.021000 0.000000)
    (-0.250000 0.024000 0.000000)
    (-0.250000 0.027000 0.000000)
    (-0.250000 0.030000 0.000000)
    (-0.250000 0.033000 0.000000)
    (-0.250000 0.036000 0.000000)
    (-0.200000 0.000000 0.000000)
    (-0.200000 0.003000 0.000000)
    (-0.200000 0.006000 0.000000)
    (-0.200000 0.009000 0.000000)
    (-0.200000 0.012000 0.000000)
    (-0.200000 0.015000 0.000000)
    (-0.200000 0.018000 0.000000)
    (-0.200000 0.021000 0.000000)
    (-0.200000 0.024000 0.000000)
    (-0.200000 0.027000 0.000000)
    (-0.200000 0.030000 0.000000)
    (-0.200000 0.033000 0.000000)
    (-0.200000 0.036000 0.000000)
    (-0.150000 0.000000 0.000000)
    (-0.150000 0.003000 0.000000)
    (-0.150000 0.006000 0.000000)
    (-0.150000 0.009000 0.000000)
    (-0.150000 0.012000 0.000000)
    (-0.150000 0.015000 0.000000)
    (-0.150000 0.018000 0.000000)
    (-0.150000 0.021000 0.000000)
    (-0.150000 0.024000 0.000000)
    (-0.150000 0.027000 0.000000)
    (-0.150000 0.030000 0.000000)
    (-0.150000 0.033000 0.000000)
    (-0.150000 0.036000 0.000000)
    (-0.100000 0.000000 0.000000)
    (-0.100000 0.003000 0.000000)
    (-0.100000 0.006000 0.000000)
    (-0.100000 0.009000 0.000000)
    (-0.100000 0.012000 0.000000)
    (-0.100000 0.015000 0.000000)
    (-0.100000 0.018000 0.000000)
    (-0.100000 0.021000 0.000000)
    (-0.100000 0.024000 0.000000)
    (-0.100000 0.027000 0.000000)
    (-0.100000 0.030000 0.000000)
    (-0.100000 0.033000 0.000000)
    (-0.100000 0.036000 0.000000)
    (-0.050000 0.000000 0.000000)
    (-0.050000 0.003000 0.000000)
    (-0.050000 0.006000 0.000000)
    (-0.050000 0.009000 0.000000)
    (-0.050000 0.012000 0.000000)
    (-0.050000 0.015000 0.000000)
    (-0.050000 0.018000 0.000000)
    (-0.050000 0.021000 0.000000)
    (-0.050000 0.024000 0.000000)
    (-0.050000 0.027000 0.000000)
    (-0.050000 0.030000 0.000000)
    (-0.050000 0.033000 0.000000)
    (-0.050000 0.036000 0.000000)
    (-0.000000 0.000000 0.000000)
    (-0.000000 0.003000 0.000000)
    (-0.000000 0.006000 0.000000)
    (-0.000000 0.009000 0.000000)
    (-0.000000 0.012000 0.000000)
    (-0.000000 0.015000 0.000000)
    (-0.000000 0.018000 0.000000)
    (-0.000000 0.021000 0.000000)
...
);
